{
  "publishedAt": "17th Jan 2022",
  "title": "Call in the Cavalry",
  "content": "As COVID-19 surges across America and the Omicron variant looms, we are facing a complete breakdown of our healthcare system. Hospitals like Harborview Medical Center in Seattle are overrun with patients with nowhere to go. Our post-acute care system (places like our nursing homes) doesn’t have adequate frontline staff to care for current patients, much less new ones. We are short 1.5 million caregivers NOW, and we will need 8 million more caregivers by 2028*.\n\nPhysically and emotionally exhausted workers are leaving their jobs, burned-out, undervalued for years, and with no prospect of reinforcements. Staff and patient suffering are commonplace.\n\nThere is a solution to this crisis.  The opportunity is now.  An Emergency Executive Order signed by the President will bring needed support for current workers and bring significant numbers of licensed Healthcare workers off the sidelines and back in the fight.\n\nFor decades our largest group of healthcare workers (the nurses aides and homecare workers) who provide the majority of the hands on care in this country, has been neglected. Their wages, embedded in our Medicare and Medicaid rates, are among the lowest in America for physically and emotionally demanding work.\n\nOur nursing homes have seen an accelerated exodus of these workers since the pandemic began. Many staff are simply unwilling to risk their own lives or bring COVID home and accidentally kill a family member. Who can blame them for less than drive-thru wages?\n\nThe exhausted workers throughout our healthcare system have fought for us and in many cases given their lives for us. They have faced unspeakable decisions, like the Nursing Assistant in Brooklyn who had to choose which dying patient’s hand to hold, and worse yet, who would die alone. \n\nWe recommend President Biden issue an Emergency Executive Caregiver Order immediately;\nThe formation of a National Care Corps for payment of a $12 an hour wage add-on for our frontline troops paid directly to Nurses, Nursing Assistants, and Homecare Workers.\n\nThe systems exist to pay these workers directly through a combination of their Social Security number and state license number.  Pay it weekly; don’t run it through Legislatures or Medicaid programs or corporate America.  Get the money to the people who can save lives, the economy, and just maybe our democracy. As divided as we are today it is not clear how much more any of them can take.\n\nThe results? Enough healthcare workers to get the upper hand against COVID and provide quality care for those in need NOW.  This brings a unifying push and economic stimulus from newly middle class caregiver jobs evenly spread through all 435 Congressional districts in the country. And it will prove budget neutral or better in a year. Care and confidence in government will improve quickly while that “can do American spirit” will galvanize us behind these heroes.\n\nPlease write or email the White House, your US Senators and Representative and urge them to call in our healthcare cavalry.\n\nJim Roe, Founder of The Caregiver Project, Former President WA Healthcare Assoc. \nConnie Anderson, RN MBA, Retired Clinical Services VP, NW Kidney Centers; Fred Hutch IRB\nJanet Kline, \n*Data per PHI – Paraprofessional Health Institute, Brooklyn NY – It’s Time to Care Jan. 21, 2020",
  "featuredImage": "/images/uploads/us-army-1st-cavalry-division-horse.jpg"
}