{
  "publishedAt": "14th Jan 2022",
  "title": "So let’s pass a Caregiver Act",
  "content": "One of our Nation’s highest duties is to care for and protect its most vulnerable citizens, our elderly. One primary group of people carry out this critical work. In the simplest and most obvious terms; giving care requires these care GIVERS. Unfortunately, we don’t have nearly enough of these people trained, willing, and able to handle this critical but often gut-wrenching mission.  The worst shortage is in our beleaguered long term care facilities and in home care, where two of three Americans will spend at least part of their life, often the very last part.\n\nAmerica is critically short of caregivers for one primary reason: few people are willing or able to do such a difficult job for what it currently pays.  Working as a care giver is thankless and hard and the pay is close to poverty level in every state.  They rely on government safety nets to make ends meet. It is also stress ridden, dealing with the decline and death of people for whom they are caring. Those who provide the most intimate care for our elderly do it knowing that they can probably make more at fast food restaurants.\n\nMore people will never be drawn to the job until there is some recognition of how hard it is, and it is treated like a profession as opposed to just a transitory occupation that they get out of as soon as they can.\nThe good news is that the government is uniquely situated to greatly remedy the current state of affairs, and can do it in a better than cost neutral way.  Economic projections show return on investment of $1.75 for every $1.00 invested in a wage add on.  \n\nA pilot project in the State of Washington is poised to show that by subsidizing caregiver wages by an increase of only 12 dollars an hour, the ship can be righted. More caring professionals, predominantly women (and a high percentage of those women of color), will begin to see caregiving as a career when it pays a living wage on which they can raise a family. Many more will also be drawn to the work, instead of repelled by their inability to make ends meet on what it currently pays.  The most compelling benefit may we be intrinsic.  A stable care giving corps opens the door to connectivity.\n\nToday, many caregivers need some form of government assistance to live. With the living wage this project will instantly provide, scores of these hard-working health care heroes will immediately leave assistance and join the middle class in stable, long-term careers caring for fellow citizens. Once its effectiveness is proven in the state of Washington, a Caregiver Act could be brought to the other Washington and revolutionize the way we care for one another in America.  Your parents, your children, your neighbors, and you all deserve better than we are doing today.\n\nJoin us in urging the President and your senators to take bold action in addressing this crisis.\n\n**Jan Kline, Secretary                     Jim Roe, Founder           Connie Anderson,  VP NWKidney Ctr, Retired**",
  "featuredImage": "/images/uploads/thecaregiveract_logo.svg"
}